Tekla Open API Reference for Tekla Structures 2025
RadiusDimension.Attributes Property
 The radius dimension attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RadiusDimensionAttributes Attributes { get; set; }
Public Property Attributes As RadiusDimensionAttributes
	Get
	Set
Property Value
Type: RadiusDimensionAttributes
See Also
Reference
RadiusDimension Class
Tekla.Structures.Drawing Namespace